burakenez/gd32e502-demo-suites-cmake-vscode/Drivers/GD32E502_standard_peripheral/Include/gd32e502_dma.h
/* bits definitions */
/* DMA_INTF */
#define DMA_INTF_GIF                            BIT(0)                         /*!< global interrupt flag of channel */
#define DMA_INTF_FTFIF                          BIT(1)                         /*!< full transfer finish flag of channel */
#define DMA_INTF_HTFIF                          BIT(2)                         /*!< half transfer finish flag of channel */
#define DMA_INTF_ERRIF                          BIT(3)                         /*!< error flag of channel */

/* DMA_INTC */
#define DMA_INTC_GIFC                           BIT(0)                         /*!< clear global interrupt flag of channel */
#define DMA_INTC_FTFIFC                         BIT(1)                         /*!< clear transfer finish flag of channel */
#define DMA_INTC_HTFIFC                         BIT(2)                         /*!< clear half transfer finish flag of channel */
#define DMA_INTC_ERRIFC                         BIT(3)                         /*!< clear error flag of channel */

/* DMA_CHxCTL,x=0..6 */
#define DMA_CHXCTL_CHEN                         BIT(0)                         /*!< channel x enable */
#define DMA_CHXCTL_FTFIE                        BIT(1)                         /*!< enable bit for channel x transfer complete interrupt */
#define DMA_CHXCTL_HTFIE                        BIT(2)                         /*!< enable bit for channel x transfer half complete interrupt */
#define DMA_CHXCTL_ERRIE                        BIT(3)                         /*!< enable bit for channel x error interrupt */
#define DMA_CHXCTL_DIR                          BIT(4)                         /*!< direction of the data transfer on the channel */
#define DMA_CHXCTL_CMEN                         BIT(5)                         /*!< circulation mode */
#define DMA_CHXCTL_PNAGA                        BIT(6)                         /*!< next address generation algorithm of peripheral */
#define DMA_CHXCTL_MNAGA                        BIT(7)                         /*!< next address generation algorithm of memory */
#define DMA_CHXCTL_PWIDTH                       BITS(8,9)                      /*!< transfer data size of peripheral */
#define DMA_CHXCTL_MWIDTH                       BITS(10,11)                    /*!< transfer data size of memory */
#define DMA_CHXCTL_PRIO                         BITS(12,13)                    /*!< priority level of channelx */
#define DMA_CHXCTL_M2M                          BIT(14)                        /*!< memory to memory mode */

/* DMA_CHxCNT,x=0..6 */
#define DMA_CHXCNT_CNT                          BITS(0,15)                     /*!< transfer counter */

/* DMA_CHxPADDR,x=0..6 */
#define DMA_CHXPADDR_PADDR                      BITS(0,31)                     /*!< peripheral base address */

/* DMA_CHxMADDR,x=0..6 */
#define DMA_CHXMADDR_MADDR                      BITS(0,31)                     /*!< memory base address */

/* DMAMUX_RM_CHxCFG,x=0..6 */
#define DMAMUX_RM_CHXCFG_MUXID                  BITS(0,6)                      /*!< multiplexer input identification */
#define DMAMUX_RM_CHXCFG_SOIE                   BIT(8)                         /*!< synchronization overrun interrupt enable */
#define DMAMUX_RM_CHXCFG_EVGEN                  BIT(9)                         /*!< event generation enable */
#define DMAMUX_RM_CHXCFG_SYNCEN                 BIT(16)                        /*!< synchronization enable */
#define DMAMUX_RM_CHXCFG_SYNCP                  BITS(17,18)                    /*!< synchronization input polarity */
#define DMAMUX_RM_CHXCFG_NBR                    BITS(19,23)                    /*!< number of DMA requests to forward */
#define DMAMUX_RM_CHXCFG_SYNCID                 BITS(24,28)                    /*!< synchronization input identification */

/* DMAMUX_RM_INTF */
#define DMAMUX_RM_INTF_SOIF0                    BIT(0)                         /*!< synchronization overrun event flag of request multiplexer channel 0 */
#define DMAMUX_RM_INTF_SOIF1                    BIT(1)                         /*!< synchronization overrun event flag of request multiplexer channel 1 */
#define DMAMUX_RM_INTF_SOIF2                    BIT(2)                         /*!< synchronization overrun event flag of request multiplexer channel 2 */
#define DMAMUX_RM_INTF_SOIF3                    BIT(3)                         /*!< synchronization overrun event flag of request multiplexer channel 3 */
#define DMAMUX_RM_INTF_SOIF4                    BIT(4)                         /*!< synchronization overrun event flag of request multiplexer channel 4 */
#define DMAMUX_RM_INTF_SOIF5                    BIT(5)                         /*!< synchronization overrun event flag of request multiplexer channel 5 */
#define DMAMUX_RM_INTF_SOIF6                    BIT(6)                         /*!< synchronization overrun event flag of request multiplexer channel 6 */
#define DMAMUX_RM_INTF_SOIF7                    BIT(7)                         /*!< synchronization overrun event flag of request multiplexer channel 7 */
#define DMAMUX_RM_INTF_SOIF8                    BIT(8)                         /*!< synchronization overrun event flag of request multiplexer channel 8 */
#define DMAMUX_RM_INTF_SOIF9                    BIT(9)                         /*!< synchronization overrun event flag of request multiplexer channel 9 */
#define DMAMUX_RM_INTF_SOIF10                   BIT(10)                        /*!< synchronization overrun event flag of request multiplexer channel 10 */
#define DMAMUX_RM_INTF_SOIF11                   BIT(11)                        /*!< synchronization overrun event flag of request multiplexer channel 11 */

/* DMAMUX_RM_INTC */
#define DMAMUX_RM_INTF_SOIFC0                   BIT(0)                         /*!< clear bit for synchronization overrun event flag of request multiplexer channel 0 */
#define DMAMUX_RM_INTF_SOIFC1                   BIT(1)                         /*!< clear bit for synchronization overrun event flag of request multiplexer channel 1 */
#define DMAMUX_RM_INTF_SOIFC2                   BIT(2)                         /*!< clear bit for synchronization overrun event flag of request multiplexer channel 2 */
#define DMAMUX_RM_INTF_SOIFC3                   BIT(3)                         /*!< clear bit for synchronization overrun event flag of request multiplexer channel 3 */
#define DMAMUX_RM_INTF_SOIFC4                   BIT(4)                         /*!< clear bit for synchronization overrun event flag of request multiplexer channel 4 */
#define DMAMUX_RM_INTF_SOIFC5                   BIT(5)                         /*!< clear bit for synchronization overrun event flag of request multiplexer channel 5 */
#define DMAMUX_RM_INTF_SOIFC6                   BIT(6)                         /*!< clear bit for synchronization overrun event flag of request multiplexer channel 6 */
#define DMAMUX_RM_INTF_SOIFC7                   BIT(7)                         /*!< clear bit for synchronization overrun event flag of request multiplexer channel 7 */
#define DMAMUX_RM_INTF_SOIFC8                   BIT(8)                         /*!< clear bit for synchronization overrun event flag of request multiplexer channel 8 */
#define DMAMUX_RM_INTF_SOIFC9                   BIT(9)                         /*!< clear bit for synchronization overrun event flag of request multiplexer channel 9 */
#define DMAMUX_RM_INTF_SOIFC10                  BIT(10)                        /*!< clear bit for synchronization overrun event flag of request multiplexer channel 10 */
#define DMAMUX_RM_INTF_SOIFC11                  BIT(11)                        /*!< clear bit for synchronization overrun event flag of request multiplexer channel 11 */

/* DMAMUX_RG_CHxCFG,x=0..3 */
#define DMAMUX_RG_CHXCFG_TID                    BITS(0,4)                      /*!< trigger input identification */
#define DMAMUX_RG_CHXCFG_TOIE                   BIT(8)                         /*!< trigger overrun interrupt enable */
#define DMAMUX_RG_CHXCFG_RGEN                   BIT(16)                        /*!< DMA request generator channel x enable */
#define DMAMUX_RG_CHXCFG_RGTP                   BITS(17,18)                    /*!< DMA request generator trigger polarity */
#define DMAMUX_RG_CHXCFG_NBRG                   BITS(19,23)                    /*!< number of DMA requests to be generated */

/* DMAMUX_RG_INTF */
#define DMAMUX_RG_INTF_TOIF0                    BIT(0)                         /*!< trigger overrun event flag of request generator channel 0 */
#define DMAMUX_RG_INTF_TOIF1                    BIT(1)                         /*!< trigger overrun event flag of request generator channel 1 */
#define DMAMUX_RG_INTF_TOIF2                    BIT(2)                         /*!< trigger overrun event flag of request generator channel 2 */
#define DMAMUX_RG_INTF_TOIF3                    BIT(3)                         /*!< trigger overrun event flag of request generator channel 3 */

